
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/goda6565/ptf-backends/actions/runs/13266204070)



<pre><code>Apply complete! Resources: 19 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.data.aws_availability_zones.current: Reading...
module.vpc.data.aws_availability_zones.current: Read complete after 0s [id=ap-northeast-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "ptf-backend-vpc-default"
        }
      + tags_all               = {
          + "Name" = "ptf-backend-vpc-default"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "ptf-backend-vpc-default"
        }
      + tags_all               = {
          + "Name" = "ptf-backend-vpc-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ptf-backend-vpc-default"
        }
      + tags_all               = {
          + "Name" = "ptf-backend-vpc-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "ptf-backend-vpc-ap-northeast-1a"
        }
      + tags_all             = {
          + "Name" = "ptf-backend-vpc-ap-northeast-1a"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "ptf-backend-vpc"
        }
      + tags_all = {
          + "Name" = "ptf-backend-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "ptf-backend-vpc-ap-northeast-1a"
        }
      + tags_all                           = {
          + "Name" = "ptf-backend-vpc-ap-northeast-1a"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "ptf-backend-vpc-private"
        }
      + tags_all         = {
          + "Name" = "ptf-backend-vpc-private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "ptf-backend-vpc-public"
        }
      + tags_all         = {
          + "Name" = "ptf-backend-vpc-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "ptf-backend-vpc-private-ap-northeast-1a"
        }
      + tags_all                                       = {
          + "Name" = "ptf-backend-vpc-private-ap-northeast-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.48.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "ptf-backend-vpc-private-ap-northeast-1c"
        }
      + tags_all                                       = {
          + "Name" = "ptf-backend-vpc-private-ap-northeast-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "ptf-backend-vpc-public-ap-northeast-1a"
        }
      + tags_all                                       = {
          + "Name" = "ptf-backend-vpc-public-ap-northeast-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "ptf-backend-vpc-public-ap-northeast-1c"
        }
      + tags_all                                       = {
          + "Name" = "ptf-backend-vpc-public-ap-northeast-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "ptf-backend-vpc"
        }
      + tags_all                             = {
          + "Name" = "ptf-backend-vpc"
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.
module.vpc.module.vpc.aws_vpc.this[0]: Creating...
module.vpc.module.vpc.aws_vpc.this[0]: Still creating... [10s elapsed]
module.vpc.module.vpc.aws_vpc.this[0]: Creation complete after 13s [id=vpc-0e70a1ca0d5050729]
module.vpc.module.vpc.aws_default_route_table.default[0]: Creating...
module.vpc.module.vpc.aws_route_table.private[0]: Creating...
module.vpc.module.vpc.aws_internet_gateway.this[0]: Creating...
module.vpc.module.vpc.aws_route_table.public[0]: Creating...
module.vpc.module.vpc.aws_default_security_group.this[0]: Creating...
module.vpc.module.vpc.aws_subnet.public[0]: Creating...
module.vpc.module.vpc.aws_subnet.private[0]: Creating...
module.vpc.module.vpc.aws_default_network_acl.this[0]: Creating...
module.vpc.module.vpc.aws_subnet.private[1]: Creating...
module.vpc.module.vpc.aws_subnet.public[1]: Creating...
module.vpc.module.vpc.aws_default_route_table.default[0]: Creation complete after 1s [id=rtb-024736e2160f50ea3]
module.vpc.module.vpc.aws_route_table.private[0]: Creation complete after 1s [id=rtb-013d204d17bce1019]
module.vpc.module.vpc.aws_subnet.public[1]: Creation complete after 1s [id=subnet-083d7f2903593da0e]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Creation complete after 1s [id=igw-0c615e8208bbadbb1]
module.vpc.module.vpc.aws_eip.nat[0]: Creating...
module.vpc.module.vpc.aws_route_table.public[0]: Creation complete after 1s [id=rtb-0ab97b6f5439f5667]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Creating...
module.vpc.module.vpc.aws_eip.nat[0]: Creation complete after 1s [id=eipalloc-0356792a25ecb8a58]
module.vpc.module.vpc.aws_default_security_group.this[0]: Creation complete after 3s [id=sg-089f71019d0076d86]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Creation complete after 3s [id=acl-08eaec587b68a937c]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Creation complete after 2s [id=r-rtb-0ab97b6f5439f56671080289494]
module.vpc.module.vpc.aws_subnet.private[0]: Creation complete after 3s [id=subnet-0332579f5732345b6]
module.vpc.module.vpc.aws_subnet.private[1]: Creation complete after 3s [id=subnet-0d424d33830b09476]
module.vpc.module.vpc.aws_route_table_association.private[1]: Creating...
module.vpc.module.vpc.aws_route_table_association.private[0]: Creating...
module.vpc.module.vpc.aws_subnet.public[0]: Creation complete after 4s [id=subnet-0ed9eafe9c05f31e7]
module.vpc.module.vpc.aws_route_table_association.public[1]: Creating...
module.vpc.module.vpc.aws_route_table_association.public[0]: Creating...
module.vpc.module.vpc.aws_nat_gateway.this[0]: Creating...
module.vpc.module.vpc.aws_route_table_association.private[1]: Creation complete after 1s [id=rtbassoc-0465476ea7c8fed10]
module.vpc.module.vpc.aws_route_table_association.private[0]: Creation complete after 1s [id=rtbassoc-0d9d1eaebace2541c]
module.vpc.module.vpc.aws_route_table_association.public[1]: Creation complete after 0s [id=rtbassoc-033e6a49ca49e1962]
module.vpc.module.vpc.aws_route_table_association.public[0]: Creation complete after 0s [id=rtbassoc-03669c6ad1b635ce9]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [10s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [20s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [30s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [40s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [50s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [1m0s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [1m10s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [1m20s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [1m30s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Still creating... [1m40s elapsed]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Creation complete after 1m46s [id=nat-07f5166d647f0c7cc]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Creating...
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Creation complete after 2s [id=r-rtb-013d204d17bce10191080289494]

Apply complete! Resources: 19 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":2,"Program":"tfcmt","SHA1":"2306f2a7a275f863a5b7de2aba2a076aa7ebc745","Vars":{},"WorkflowName":"Terraform"} -->